/**
 * Покажите знак числа (важность: 2)
 *
 * Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в alert:
 * - '1', если значение больше нуля,
 * - '-1', если значение меньше нуля,
 * - '0', если значение равно нулю.
 * Предполагается, что пользователь вводит только числа.
 */

const number = prompt('Введите число', '')

if (number > 0) {
  alert('Положительное число')
} else if (number < 0) {
  alert('Отрицательное число')
} else {
  alert('Ноль')
}
