/**
 * Объясните значение "this" (важность: 3)
 *
 * В представленном ниже коде мы намерены вызвать obj.go() метод 4 раза подряд.
 * Но вызовы (1) и (2) работают иначе, чем (3) и (4) . Почему?
 */

let obj, method;
obj = {
  go: function() { alert(this); }
};
obj.go(); // (1) [object Object]
(obj.go)(); // (2) [object Object]
(method = obj.go)(); // (3) undefined
(obj.go || obj.stop)(); // (4) undefined

// Решение:
// 1 и 2 - вызывается значение ссылочного типа
// 3 и 4 - значение ссылочного типа заменяется на функцию

// В ответе:
// любая другая операция (подобно операции
// присваивания = или сравнения через логические операторы, например || )
// превращает это значение в обычное, которое не несёт информации, позволяющей
// установить this
