/**
 * Объекты-константы? (важность: 5)
 *
 * Можно ли изменить объект, объявленный с помощью const? Как вы думаете?
 */

const user = {
  name: "John"
};

// это будет работать?
user.name = "Pete";

// Решение:
// Будет, так как сама переменная user не изменяется. Переменная user хранится в стеке, const смотрит именно на то, что
// не меняется ли значение переменной в стеке. В переменной user хранится ссылка на объект в куче (Memory heap).
// А мы изменяем значение свойства объекта, который хранится в куче.
//
// В общем - это будет работать.
