/**
 * Eval-калькулятор
 * важность: 4
 *
 * Создайте калькулятор, который запрашивает ввод какого-нибудь арифметического выражения и возвращает результат его вычисления.
 * В этой задаче нет необходимости проверять полученное выражение на корректность, просто вычислить и вернуть результат.
 */

// без учета атак и прочего
const a = +prompt('Введите число 1')
const operator = prompt('Введите оператор')
const b = +prompt('Введите число 2')

const result = window.eval(`a ${operator} b`)
alert(result)