/**
 * Побитовый оператор и значение (важность: 5)
 *
 * Почему побитовые операции в примерах ниже не меняют число? Что они делают внутри?
 */

// Решение: это исключающее ИЛИ. 0 в битовом представлении будет представлен 32-мя нулями, соответственно число он не поменяет.
alert( 123 ^ 0 ); // 123

// Решение: точно то же самое, что и выше.
alert( 0 ^ 123 ); // 123

// Решение: это побитовое НЕ. Мы первым ~ инвертируем число и получаем -124, а вторым ~ инвертируем его обратно.
alert( ~~123 ); // 123

