/**
 * Почему результат разный? (важность: 5)
 *
 * Почему результат второго alert'а такой странный?
 */

alert( 123456789 ^ 0 ); // 123456789
alert( 12345678912345 ^ 0 ); // 1942903641

// Решение: потому что побитовые операторы умеют работать только с числами меньше 2'147'483'647
// Это наибольшее число, которое вмещает 32-битный знаковый целый тип данных
// Обычно число в JavaScript имеет 64-битный формат с плавающей точкой. При этом часть
// 123_456_789 < 2_147_483_647 === true
// 12_345_678_912_345 < 2_147_483_647 === false