/**
 * Вопрос о "if" (важность: 5)
 *
 * Какие из перечисленных ниже alert выполнятся?
 * Какие конкретно значения будут результатами выражений в условиях if(...)?
 */

if (-1 || 0) alert( 'first' );
if (-1 && 0) alert( 'second' );
if (null || -1 && 1) alert( 'third' );

// Решение:
// alert('first') выполнится, так как -1 - это truthy-значение
// alert('second') не выполнится, так как 0 - это falsy-значение
// alert('third') выполнится, так как сначала выполнится -1 && 1 -> вернет 1, как последнее truthy-значение
// затем null || 1 -> вернет 1, так как это первое truthy-значение.
