/**
 * Армия функций (важность: 5)
 *
 * Следующий код создаёт массив из стрелков (shooters).
 *
 * Каждая функция предназначена выводить их порядковые номера. Но что-то пошло не так…
 */

function makeArmy() {
  let shooters = [];
  
  let i = 0;
  while (i < 10) {
    let shooter = function() {
      alert( i ); // должна выводить порядковый номер
    };
    shooters.push(shooter);
    i++;
  }
  
  return shooters;
}

let army = makeArmy();

army[0](); // у 0-го стрелка будет номер 10
army[5](); // и у 5-го стрелка тоже будет номер 10
// ... у всех стрелков будет номер 10, вместо 0, 1, 2, 3...

// Решение:
// 1) Сделать через for. тогда у каждого будет свое лексическое окружение
// 2) Объявить переменную j, внутри цикла
// 3) Прибиндить аргумент
