/**
 * Сумма введённых чисел (важность: 4)
 *
 * Напишите функцию sumInput(), которая:
 *
 * Просит пользователя ввести значения, используя prompt и сохраняет их в массив.
 * Заканчивает запрашивать значения, когда пользователь введёт не числовое значение, пустую строку или нажмёт «Отмена».
 * Подсчитывает и возвращает сумму элементов массива.
 * P.S. Ноль 0 – считается числом, не останавливайте ввод значений при вводе «0».
 */

function sumInput() {
  let input
  
  const inputs = []

  while (true) {
    input = prompt(`Введите число. Предыдущий ввод: [${inputs}]`)
    if (input === null || input === '' || isFinite(input)) break
    else inputs.push(+input)
  }
  
  return inputs.reduce((acc, cur) => acc + cur, 0)
}
