/**
 * Какой обработчик запустится? (важность: 5)
 *
 * В переменной button находится кнопка. Изначально на ней нет обработчиков.
 * Который из обработчиков запустится? Что будет выведено при клике после выполнения кода?
 */

button.addEventListener("click", () => alert("1"));

button.removeEventListener("click", () => alert("1"));

button.onclick = () => alert(2);

// Решение:
// 1. Сначала выведется alert("1"), затем alert(2)
// alert("1") - не удалится, так как там стрелочная функция при удалении. А надо ссылку на функцию