/**
 * Можно ли добавить свойство строке? (важность: 5)
 *
 * Взгляните на следующий код:
 */

let str = "Привет";

str.test = 5;

alert(str.test);

// Решение: на экран выведется undefined, конкретно строке нельзя добавить свойство
// Можно добавить прототипу String это свойство, но тогда оно появится у всех свойств
// Строка присвоения ошибки не вызовет, но просто проигнорирует это

// Решение портала:
// Также в режиме `use strict` строка с присвоением выбросит ошибку
// Без строгого режима - создается обертка - добавляется свойство - обертка удаляется - str больше не имеет доступа к test
