/**
 * Алгоритм поиска
 *
 * Задача состоит из двух частей.
 *
 * У нас есть объекты:
 *
 * С помощью свойства __proto__ задайте прототипы так, чтобы поиск любого свойства
 * выполнялся по следующему пути: pockets → bed → table → head.
 * Например, pockets.pen должно возвращать значение 3 (найденное в table), а bed.glasses – значение 1 (найденное в head).
 *
 * Ответьте на вопрос: как быстрее получить значение glasses – через pockets.glasses или
 * через head.glasses? При необходимости составьте цепочки поиска и сравните их.
 */

let head = {
  glasses: 1
};

let table = {
  pen: 3,
  __proto: head,
};

let bed = {
  sheet: 1,
  pillow: 2,
  __proto: table,
};

let pockets = {
  money: 2000,
  __proto__: bed
};

// Решение:
// pockets.glasses - медленнее, так как сначала посмотрим в pockets, затем в bed, затем в table, затем в head
// head.glasses быстрее, так как именно в этом объекте и есть такой свойство, цепочек не будет.
//
// С Learn.javascript.ru - неважно, для движка это не важно. Производительность будет одинаковой.
