/**
 * Что код выведет в консоли? (важность: 5)
 *
 */


setTimeout(function timeout() {
  console.log('Таймаут');
}, 0);

let p = new Promise(function(resolve, reject) {
  console.log('Создание промиса');
  resolve();
});

p.then(function(){
  console.log('Обработка промиса');
});

console.log('Конец скрипта');

// Решение:
// 1. "Создание промиса". Так как callback внутри промиса является обычным синхронным кодом
// 2. "Конец скрипта". Обычный синхронный код, но в конце страницы
// 3. "Обработка промиса". Так как это микрозадача
// 4. "Таймаут". Так как это макрозадача.
