/**
 * Отсортируйте массив с буквой ё (важность: 5)
 *
 * Используя Intl.Collator, отсортируйте массив:
 * В этом примере порядок сортировки не должен зависеть от регистра.
 *
 * Что касается буквы "ё", то мы следуем обычным правилам сортировки буквы ё, по которым «е» и «ё» считаются одной
 * и той же буквой, за исключением случая, когда два слова отличаются только в позиции буквы «е» / «ё» –
 * тогда слово с «е» ставится первым.
 */

let animals = ["тигр", "ёж", "енот", "ехидна", "АИСТ", "ЯК"];

// Решение:
// По-моему проще через встроенный метод в прототип, это тот же Intl.Collator
animals.sort((a, b) => a.localeCompare(b, 'ru'))

alert( animals ); // АИСТ,ёж,енот,ехидна,тигр,ЯК