/**
 * Какие значения выведет цикл for? (важность: 4)
 *
 * Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
 * Оба цикла выведут alert с одинаковыми значениями или нет?
 */

// 1. Постфиксная форма
for (let i = 0; i < 5; i++) alert( i );

// 2. Префиксная форма
for (let i = 0; i < 5; ++i) alert( i );

/**
 * Решение:
 *
 * В обоих вариантах от 0 до 4, так как шаг выполняется после тела цикла и перед следующим условием.
 * Соответственно уже в условие попадут одинаковые индексы i, разницы нет
 */
