/**
 * Почему 6.35.toFixed(1) == 6.3? (важность: 4)
 *
 * Методы Math.round и toFixed, согласно документации,
 * округляют до ближайшего целого числа: 0..4 округляется в меньшую сторону, тогда как 5..9 в большую сторону.
 *
 *
 */

alert( 1.35.toFixed(1) ); // 1.4
alert( 6.35.toFixed(1) ); // 6.3

// Решение: можно добавить 0.01 к числу, затем применить toFixed
// Проблема скорее всего из-за потери точности у числа

// Решение с портала:
// Да, дело в потере точности
// Проверить можно через .toFixed(20)
