/**
 * Ввод числового значения (важность: 5)
 *
 * Создайте функцию readNumber, которая будет запрашивать ввод числового значения до тех пор, пока посетитель его не введёт.
 *
 * Функция должна возвращать числовое значение.
 *
 * Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.
 */

function readNumber() {
  let input
  
  while (true) {
    input = prompt('Введите число', '')
    
    if (input === '') break
    if (input === null) break
    if (isFinite(input)) break
  }
  
  return Boolean(input) ? +input : null
}
